[
    {
      "id": "1",
      "title": "How to use the search function for specific filters.",
      "date": "Written on 27 / April / 2025 by Frank Fulton",
      "body": "<h2>1. The Search Input Field</h2><p>At the top of the page, there's a search bar where you can type your search query. As you type, the <code>oninput</code> event triggers the <code>filterScores()</code> function, which checks your query and filters the displayed scores accordingly.</p><h2>2. General Search Across Multiple Attributes</h2><p>When you type a search query, the function checks the <code>title</code>, <code>composer</code>, <code>arranger</code>, <code>key</code>, and <code>year</code> of each score to see if it matches your input. If the query matches any of these attributes, the relevant score will appear in the results. Here's an example of how the filtering works:</p><ul><li><strong>Title Search:</strong> If you type <code>\"Symphony\"</code>, it will show all scores with \"Symphony\" in the title.</li><li><strong>Composer Search:</strong> If you type <code>\"Beethoven\"</code>, it will show all scores composed by Beethoven.</li><li><strong>Year Search:</strong> If you type <code>\"2021\"</code>, it will show all scores created in the year 2021.</li></ul><h2>3. Composer Filter with Specific Syntax</h2><p>For more advanced filtering, you can specify the composer in your query using a special syntax. For example:</p><code>composer: 'Beethoven'</code><p>This will filter the scores and display only those composed by Beethoven. The filter works by looking for the <code>composer</code> field in the JSON data. The composer name is case-insensitive, so typing <code>\"beethoven\"</code> or <code>\"BEETHOVEN\"</code> will work the same way.</p><h2>4. Dynamic Rendering of Scores</h2><p>Once a search query is entered, the <code>filterScores()</code> function filters the available scores based on your criteria and then dynamically updates the page to display only the matching results. Each score is displayed with key details such as its title, composer, arranger, price, and a thumbnail image. Additionally, each item links to a dedicated page for further details.</p><h2>5. Fetching Data from the Server</h2><p>The scores data is fetched from a file called <code>scores.json</code>. This file contains an array of objects, each representing a musical score with various properties such as <code>title</code>, <code>composer</code>, <code>arranger</code>, <code>key</code>, <code>year</code>, <code>opus</code>, <code>price</code>, etc. The <code>renderScores()</code> function takes this data and dynamically creates HTML content to display the scores on the page.</p><h2>6. Practical Example</h2><p>If you are searching for <code>\"Mozart\"</code> in the search bar, the filtering logic will check all scores and show those with the composer \"Mozart.\" If no matches are found, it will simply return an empty result set.</p><h2>Conclusion</h2><p>The search function in Salpinx Music is designed to make it easy to find scores based on various criteria. By typing keywords or using specific filters such as <code>composer: 'Beethoven'</code>, you can quickly narrow down the list of available scores. The function is designed to be fast and responsive, ensuring a smooth user experience.</p>"
    }, {
      "id": "2",
      "title": "About Us",
      "date": "Written on 27 / April / 2025 by Frank Fulton",
      "body": "<p>We here at Salpinx Music were founded in 2025 by myself, who wanted to explore web development but also music scoring at the same time.We have been working hard to create a good experience here, however we are still in the early phase, so bugs are definetly occuring. Please report all bugs to <code>frank@salpinxmusic.com</code>. Currently, we can only display scores, and are working to make a solution in which they are easily downloadable viewable online. These are very early days and from an ameteur developer, so don't expect anything too fancy! Our <a href=\"https://www.youtube.com/@salpinxmusicscores\">YouTube</a> channel displays all of our scores as we make them. If you would like to submit scores or become an arranger, also please contact <code>frank@salpinxmusic.com</code>.</p>"
    }
]
  